import unittest
from words_parser.address_normaliser import Address_normaliser


class Tests(unittest.TestCase):
    def test_split_address(self):
        addresses = ["город Екатеринбург Солнечная улица 12",
                     "улица Солнечная 12А город Екатеринбург",
                     "Екатеринбург ул.Солнечная 12/11",
                     "поселок Горбатовка проспект Ленина 4-1А",
                     "поселок Горбатовка  Ленина проспект 4-1А к1",
                     "Екатеринбург бул.Солнечный 12/1 к2 с1",
                     "ул Земляничная 13Б село Зеленое",
                     "Екатеринбург Степана Разина улица 2",
                     "село Искра ул 1-я Центральная 5А"]

        expected_results = [('Екатеринбург', 'Солнечная', '12'),
                            ('Екатеринбург', 'Солнечная', '12А'),
                            ('Екатеринбург', 'Солнечная', '12/11'),
                            ('Горбатовка', 'Ленина', '4-1А'),
                            ('Горбатовка', 'Ленина', '4-1А'),
                            ('Екатеринбург', 'Солнечный', '12/1'),
                            ('Зеленое', 'Земляничная', '13Б'),
                            ('Екатеринбург', 'Степана Разина', '2'),
                            ('Искра', '1-я Центральная', '5А')]

        for i in range(len(addresses)):
            result = Address_normaliser.split_address(addresses[i])
            self.assertEqual(result, expected_results[i])